Revit 2027 API
UVGridlineType Enumeration
 A choice between U-gridlines or V-gridlines of a divided surface U Gridlines V Gridlines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum UVGridlineType
Public Enumeration UVGridlineType
public enum class UVGridlineType
type UVGridlineType
Members
Member name | Value | Description
U | 0
V | 1
See Also
Reference
Autodesk.Revit.DB Namespace